import styles from "./aside.module.css";
import { useState } from "react";
import classNames from "classnames";
import { AsideMenu } from "./aside-menu/aside-menu";
import { AsideMessages } from "./aside-messages/aside-messages";

const M_DATA = [
  {
    id: 0,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 1,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 2,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 3,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 4,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 5,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 6,
    title: "18:22 20/12/24 -  20:22 21/12/24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
];
const W_DATA = [
  {
    id: 0,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 1,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 2,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 3,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 4,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 5,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
  {
    id: 6,
    title: "18:22 20.12.24",
    text: "לורם איפסום דולור סיט אמט הבקיץ לכנוץ וואל מונפרד אגת שנרא וק. קלאצי צופעט צוט יבש, סיט יבש, - בורק? לכנו למרקוח .",
  },
];

export const Aside = () => {
  const [menuIsActive, setMenuIsActive] = useState(false);

  const toggleActive = () => {
    setMenuIsActive(!menuIsActive);
  };

  return (
    <div
      className={classNames(styles.aside, {
        [styles.active]: menuIsActive,
      })}
    >
      <AsideMenu toggleActive={toggleActive} menuIsActive={menuIsActive} />
      <div className={styles.messages}>
        <AsideMessages title={"עדכוני תנועה "} messages={M_DATA} />
        <AsideMessages title={"התראות"} messages={W_DATA} />
      </div>
    </div>
  );
};
